#!/usr/bin/env python3
# -*- coding: utf-8 -*-

###-----------------------------------------------------------------------------------------------------------------  class(begin)
### TODO:
# max 可以接收任意多个参数
print ( max(2, 3, 1, -5) )

# 类型转换
type_int = int(12.34)
type_float = float('12.34')
type_str = str(1.23)
type_true = bool(1)
type_false = bool('')

# 函数名可以赋值给一个变量
a = abs  # 变量a指向abs函数
print( a(-1) ) # 1

# 把一个整数转成16进制字符串
print( hex( 10 ) )
###=================================================================================================================

